app/controllers/welcome_controller.rb

  def index

    # Custom colors for the various states.
    colors = {
        'Papal States'.to_sym => '#EFC050',
        'Duchy of Parma'.to_sym => '#D65076',
        'Kingdom of Sardinia'.to_sym => '#4B61D1',
        'Grand Duchy of Tuscany'.to_sym => '#7FCDCD',
        'Duchy of Modena and Reggio'.to_sym => '#D0DD3D',
        'Kingdom of Lombardy Venetia'.to_sym => '#009B77',
        'Kingdom of the Two Sicilies'.to_sym => '#BC243C'
    }

    # Budget chart.
    @data_chart_01 = []
    Budget.all.order(value: :desc).each_with_index { |b, i|
      @data_chart_01 << {
        name: b[:state],
        y: b[:value],
        color: colors[b[:state].to_sym],
        sliced: i == 0
      }
    }

    # Population chart.
    @data_chart_02 = []
    Population.all.order(value: :desc).each_with_index { |b, i|
---
SELECT "budgets".* FROM "budgets"  ORDER BY "budgets"."value" DESC
SELECT "populations".* FROM "populations"  ORDER BY "populations"."value" DESC

    @data_chart_03 = []
    total = 0
    states = 0
    Tax.all.order(taxes_per_person: :desc).each { |b|
---
SELECT "taxes".* FROM "taxes"  ORDER BY "taxes"."taxes_per_person" DESC

    tmp_2 = {name: 'Kingdom of Sardinia', data: [], color: '#4B61D1'}
    tmp_3 = {name: 'Kingdom of Lombardy Venetia', data: [], color: '#009B77'}
    tmp_4 = {name: 'Kingdom of the Two Sicilies', data: [], color: '#BC243C'}
    Pil.group(:state, :year).order(state: :asc, year: :asc).average(:pil_per_person).each { |key, value|
---
SELECT "pils".* FROM "pils" WHERE ("pils"."state" IS NOT NULL)  ORDER BY "pils"."state" ASC, "pils"."year" ASC
SELECT AVG("pils"."pil_per_person") AS average_pil_per_person, state AS state, year AS year FROM "pils" GROUP BY "pils"."state", "pils"."year"  ORDER BY "pils"."state" ASC, "pils"."year" ASC